# Sales Data Analysis

## Imports
Import Pandas and Numpy

In [1]:
import pandas as pd
import numpy as np

## Read in dataset
Use the `read_csv` function in Pandas to load in the file

In [2]:
# Data provided by https://www.superdatascience.com/
df = pd.read_csv("OfficeSupplies.csv")

## General analysis on dataset
Get initial analysis on the data:
- `shape` tells how many rows and columns are in the data frame
- `head` shows the first five rows (by default) of the data frame
- `dtypes` shows each column name and each type the values of the column has
- [`describe`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html) gives a few statistical measures on each numeric column:
    - The count, which should match the number of rows from calling `shape`
    - The mean (or average)
    - The [standard deviation](https://en.wikipedia.org/wiki/Standard_deviation)
    - The minimum and maximum value
    - The first, second, and third percentiles (or [quartiles](https://en.wikipedia.org/wiki/Quartile))

In [3]:
df.shape

(43, 6)

In [4]:
df.dtypes

OrderDate      object
Region         object
Rep            object
Item           object
Units           int64
Unit Price    float64
dtype: object

In [22]:
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

In [5]:
df.describe()

           Units  Unit Price
count  43.000000   43.000000
mean   49.325581   20.308605
std    30.078248   47.345118
min     2.000000    1.290000
25%    27.500000    3.990000
50%    53.000000    4.990000
75%    74.500000   17.990000
max    96.000000  275.000000

## Any null values in the dataset?
Using Pandas to see if there are any [null values](https://pandas.pydata.org/pandas-docs/stable/missing_data.html) that are in the dataset. This is to see if we need to handle these values, either by removing the rows or fill in the missing data with another value.

In [7]:
df.isnull().values.any()

False

## Reps who sold the most units

https://sparkbyexamples.com/pandas/pandas-groupby-sum-examples/

In [20]:
df2 = df.groupby('Rep')['Units'].sum().sort_values(ascending=False)
print(df2)

Rep
Richard    396
Alex       281
Bill       213
Matthew    193
Rachel     183
Morgan     173
Susan      170
Smith      156
James      142
Nick       125
Thomas      89
Name: Units, dtype: int64

## Add a new column to our dataset

In [24]:
df["Total"] = df["Units"] * df["Unit Price"]
df.head()

,OrderDate,Region,Rep,Item,Units,Unit Price,Total Price,Total
0,4-Jul-2014,East,Richard,Pen Set,62,4.99,309.38,309.38
1,12-Jul-2014,East,Nick,Binder,29,1.99,57.71,57.71
2,21-Jul-2014,Central,Morgan,Pen Set,55,12.49,686.95,686.95
3,29-Jul-2014,East,Susan,Binder,81,19.99,1619.19,1619.19
4,7-Aug-2014,Central,Matthew,Pen Set,42,23.95,1005.90,1005.90

## Additional analysis

### Who sold the most total?

In [26]:

df3 = df.groupby('Rep')['Total'].sum().sort_values(ascending=False)
print(df3)

Rep
Matthew    3109.44
Susan      3102.30
Alex       2812.19
Richard    2363.04
Bill       1749.87
Smith      1641.43
Morgan     1387.77
James      1283.61
Thomas     1203.11
Nick        536.75
Rachel      438.37
Name: Total, dtype: float64

### What region sold the most?

In [30]:
df.groupby('Region')['Total'].sum()

Region
Central    11139.07
East        6002.09
West        2486.72
Name: Total, dtype: float64

### What item sold the most?

In [31]:
df.groupby("Item")['Total'].sum()

Item
Binder     9577.65
Desk       1700.00
Pen        2045.22
Pen Set    4169.87
Pencil     2135.14
Name: Total, dtype: float64

### Who sold the most in each region?

In [38]:
group = df.groupby(["Region","Rep"])['Total'].sum()
group

Region   Rep
Central  Alex       2812.19
         Bill       1749.87
         Matthew    3109.44
         Morgan     1387.77
         Rachel      438.37
         Smith      1641.43
East     Nick        536.75
         Richard    2363.04
         Susan      3102.30
West     James      1283.61
         Thomas     1203.11
Name: Total, dtype: float64

https://sparkbyexamples.com/python-pandas-tutorial-for-beginners/